<h2 style='color:purple' align='center'>Naive Bayes Part 1: Predicting survival from titanic crash</h2>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

**I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female**

In [7]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [12]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [13]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [14]:
model.score(X_test,y_test)

0.7649253731343284

In [15]:
X_test[0:10]

     Pclass        Age     Fare  female
810       3  26.000000   7.8875       0
860       3  41.000000  14.1083       0
15        2  55.000000  16.0000       1
806       1  39.000000   0.0000       0
237       2   8.000000  26.2500       1
236       2  44.000000  26.0000       0
113       3  20.000000   9.8250       1
439       2  31.000000  10.5000       0
409       3  29.699118  25.4667       1
483       3  63.000000   9.5875       1

In [16]:
y_test[0:10]

810    0
860    0
15     1
806    0
237    1
236    0
113    0
439    0
409    0
483    1
Name: Survived, dtype: int64

In [17]:
model.predict(X_test[0:10])

array([0, 0, 1, 0, 1, 0, 1, 0, 1, 1], dtype=int64)

In [18]:
model.predict_proba(X_test[:10])

array([[0.96587674, 0.03412326],
       [0.96796029, 0.03203971],
       [0.20253647, 0.79746353],
       [0.7247744 , 0.2752256 ],
       [0.14879054, 0.85120946],
       [0.91756712, 0.08243288],
       [0.39877311, 0.60122689],
       [0.92418361, 0.07581639],
       [0.41970072, 0.58029928],
       [0.32916113, 0.67083887]])

In [19]:
model.predict([[3,26.000000,7.8875,0]])

array([0], dtype=int64)